#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-4839aGsMPDh3SohR" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
[command]/home/runner/work/_temp/710467bd-0f1d-4606-bfe0-b29915b2a396/terraform-bin plan -no-color
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-4839aGsMPDh3SohR

Waiting for the plan to start...

Terraform v1.0.7
on linux_amd64
Initializing plugins and modules...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfproviderspotinst_repositorysetup_managingteam_4EDAB9E0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderspotinst_repositorysetup_managingteam_4EDAB9E0" {
      ~ etag       = "W/\"4425ef4a356640953cf71a4b2a604b118e6d7dd672539e4067c4fa51ef44f2a5\"" -> "W/\"eab224582feca85d6acaf5c112eb564a965f2b45e83e895ad5069e8611aa7f9c\""
        id         = "6602018:cdktf-provider-spotinst"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdnsimplego_repositorysetup_managingteam_0FB60159 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdnsimplego_repositorysetup_managingteam_0FB60159" {
      ~ etag       = "W/\"66693dd5af238b59e01f3945f87cbb8b3daae2bfe172301e08e12f92959531f7\"" -> "W/\"32bb8645b211cdb817798927df94dbb74cc2e2b14a7d72a5478429fea40cd687\""
        id         = "6602018:cdktf-provider-dnsimple-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidervault_repositorysetup_managingteam_5D99059E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidervault_repositorysetup_managingteam_5D99059E" {
      ~ etag       = "W/\"53a72c63c277dec45ecc24a06a38334d85f479b0c531cdf3cc5b31632c4c25fd\"" -> "W/\"1a58c84c1585ce2d8b645695eb574667925f237886645416c919938aca6f45b7\""
        id         = "6602018:cdktf-provider-vault"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpostgresqlgo_repositorysetup_managingteam_CD45B76A has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpostgresqlgo_repositorysetup_managingteam_CD45B76A" {
      ~ etag       = "W/\"d8fcb96f6f7d21b98644da6d688495c8cb0cfb0874e739382c80759b10105859\"" -> "W/\"36ff8701145f93c8fc119d6691a6aa3d2980ba81e22bf9cd32d0f51ce50f1855\""
        id         = "6602018:cdktf-provider-postgresql-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazureadgo_repositorysetup_managingteam_05337DF5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazureadgo_repositorysetup_managingteam_05337DF5" {
      ~ etag       = "W/\"154b3a86914e5dedd67d4e9c495c375532d675a4eec0f1f166bc654b12b64142\"" -> "W/\"851d8b08d2e789b361cc2693bc2e76ab2f48a71bcd7fdb1a35edec5de9476315\""
        id         = "6602018:cdktf-provider-azuread-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideraws_repositorysetup_managingteam_AFE63812 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_repositorysetup_managingteam_AFE63812" {
      ~ etag       = "W/\"05c4533f70dd101b75549d5dc85ab6b858d632dbd9719d2c489ea42479e2b8ef\"" -> "W/\"2464ea95259e57388bdea60d1b996288f7e4dc2249751cb92d1e2dd6eb418d8e\""
        id         = "6602018:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidersnowflakego_repositorysetup_managingteam_EB46CF4B has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidersnowflakego_repositorysetup_managingteam_EB46CF4B" {
      ~ etag       = "W/\"3e09c935f7257c3bb76e840add0f19c4c15815d000b43d1d8245224807ce06a9\"" -> "W/\"f29ec3aee65560fcd41ed2ae14f15876163055bb0c2c4324db60eac36e95f77e\""
        id         = "6602018:cdktf-provider-snowflake-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderawsgo_repo_AE367E97 has been changed
  ~ resource "github_repository" "repos_cdktfproviderawsgo_repo_AE367E97" {
      ~ etag                   = "W/\"f42e907886e7ba16aa7131980141f98d7649e8aaebeca80b5fcf8875279520e6\"" -> "W/\"4ed7363d192ab54fec79458ff199b19a0dface41c7e598fff961810913dc6cb6\""
        id                     = "cdktf-provider-aws-go"
        name                   = "cdktf-provider-aws-go"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderlocal_repositorysetup_managingteam_9E9A7979 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderlocal_repositorysetup_managingteam_9E9A7979" {
      ~ etag       = "W/\"ef6b5c5fbe5ef8db3e4641f7a1caf1c95f2aee8ff5f367a897f9ad171cfe82c6\"" -> "W/\"5d342172c2b486155e5ec14342752095a215169a781b8d1c6074c3797a175455\""
        id         = "6602018:cdktf-provider-local"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadoggo_repositorysetup_managingteam_926F7CC5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadoggo_repositorysetup_managingteam_926F7CC5" {
      ~ etag       = "W/\"0fc87e459e4688482c11f50256ab7c199ff3ce16521d210deb4f5190daba4783\"" -> "W/\"f744eeced86f7bb5b055745a71a9ade453635a69ce4b40660fdf6b9825ee8325\""
        id         = "6602018:cdktf-provider-datadog-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudinit_repositorysetup_managingteam_DFBE2D6C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudinit_repositorysetup_managingteam_DFBE2D6C" {
      ~ etag       = "W/\"76992584fe0813a854a0d6831809112063b75639b016b3ff5972078870ee4949\"" -> "W/\"a7a46e772216b4289f4d0ce323cede92ae483c1a4924bdc67c18ffb7b8306fad\""
        id         = "6602018:cdktf-provider-cloudinit"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_repositorysetup_managingteam_1EC6BF14 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_repositorysetup_managingteam_1EC6BF14" {
      ~ etag       = "W/\"1ba59abbafba03d4ae41a6573324fe5a4c8f7064038370e3396286ab2c4a82a9\"" -> "W/\"21dc60c5368dbafc78e2b40df51155c681e1935deb47c9698300086965fa0c7e\""
        id         = "6602018:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderexternal_repositorysetup_managingteam_247C14FA has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_repositorysetup_managingteam_247C14FA" {
      ~ etag       = "W/\"4efed85f2485e9399629c1ff2648ffc32d03bc473d9341098f19acc35696b252\"" -> "W/\"fdb9fb758193e894467c41cbe8b5d8cd267c23367591ef2f18d6e754c1ce92e4\""
        id         = "6602018:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazuread_repositorysetup_managingteam_6FD24BF4 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazuread_repositorysetup_managingteam_6FD24BF4" {
      ~ etag       = "W/\"660f6325f5a6b71a1657ae10865176d3f12fff156445c32580ebaac19e009b75\"" -> "W/\"b28af7f5251b377145cd4e385e163ebaa8211fc5158ddae1505ed95ba29e2f92\""
        id         = "6602018:cdktf-provider-azuread"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadog_repositorysetup_managingteam_29E8E525 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_repositorysetup_managingteam_29E8E525" {
      ~ etag       = "W/\"50d61f63591046dc8cb03df69fbb851c25b518863ad7857400f2cbca02d31318\"" -> "W/\"095688e325cee40cd6a77364eebe1dd760c5ec7385437259bda3566024e0c0f5\""
        id         = "6602018:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernull_repo_8A692B1D has been changed
  ~ resource "github_repository" "repos_cdktfprovidernull_repo_8A692B1D" {
      ~ etag                   = "W/\"b9000a356d0120c15850bbb1d8eb3d8be50cb9f02951e1a42635570df81cfaf0\"" -> "W/\"52114956f559e70479867fb7ee32533a063077bcda328dd13991a122a95d5bec\""
        id                     = "cdktf-provider-null"
        name                   = "cdktf-provider-null"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhashicups_repositorysetup_managingteam_6073CDD4 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhashicups_repositorysetup_managingteam_6073CDD4" {
      ~ etag       = "W/\"9b0173113c4d23a2e8d795aa73d24a6d82c0beba0d17cbede9dbef12baa6386e\"" -> "W/\"bb6ecbda9f5d02fcd3c0fa23e5256db88b6de69e7741e5adcae41711048fff82\""
        id         = "6602018:cdktf-provider-hashicups"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderupcloud_repositorysetup_managingteam_D47CCEF5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderupcloud_repositorysetup_managingteam_D47CCEF5" {
      ~ etag       = "W/\"338db53c852466db464a48df0d67aee98b901b96643e85a8e3a3eeadfa1bfa39\"" -> "W/\"27d86ebcf9c99a4173be32f6597a525ddd5c0745858117181f0d74c10a7036d6\""
        id         = "6602018:cdktf-provider-upcloud"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernewrelicgo_repositorysetup_managingteam_18EA944B has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernewrelicgo_repositorysetup_managingteam_18EA944B" {
      ~ etag       = "W/\"638f90379abf2d5a394f7dc350e8286f6c822bfe39e55543de23724b7c303a70\"" -> "W/\"1fcd3f6da4919bf6b256864712ad2bc148f8f53f897fedfed25a6ff4d6350b80\""
        id         = "6602018:cdktf-provider-newrelic-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertemplate_repositorysetup_managingteam_4C76673E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertemplate_repositorysetup_managingteam_4C76673E" {
      ~ etag       = "W/\"3c7a794ab3776538e58f2df54be7620311e9222af8c851b1d7339956469dcfa1\"" -> "W/\"42e37981d961f1ffd310ba8313f6ced29b3a31927551e7a66d5449e58740f6bb\""
        id         = "6602018:cdktf-provider-template"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergitlab_repo_2ECAC2E4 has been changed
  ~ resource "github_repository" "repos_cdktfprovidergitlab_repo_2ECAC2E4" {
      ~ etag                   = "W/\"8664c93799a05b4a88f1f41070b2352198551670f72c97e7ab5955f091d620f7\"" -> "W/\"369da6c89723276af0b408f2669d29b5305e1638fdffef981f1b2b9e39742968\""
        id                     = "cdktf-provider-gitlab"
        name                   = "cdktf-provider-gitlab"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderupcloudgo_repositorysetup_managingteam_D8F8114B has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderupcloudgo_repositorysetup_managingteam_D8F8114B" {
      ~ etag       = "W/\"ab0f7b40f063dfbf21ed58ebb99e546c25adb6b02de8d43d06250a728ef5ef3c\"" -> "W/\"960374669e5a682186eeae221fdab05b212fe99a6b61b69c72d447688ae43c39\""
        id         = "6602018:cdktf-provider-upcloud-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetes_repositorysetup_managingteam_35C88BB2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_repositorysetup_managingteam_35C88BB2" {
      ~ etag       = "W/\"9a5d6d36372baca6bc19888114bf8b398e3c3d330d5c8af75e2f193d5fe22a7d\"" -> "W/\"a90a6866ee41e3e9f9679a5aaddd5d67eb78e34f130e15dfeba3084e57e263af\""
        id         = "6602018:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdigitalocean_repositorysetup_managingteam_751C9ACD has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdigitalocean_repositorysetup_managingteam_751C9ACD" {
      ~ etag       = "W/\"e05330fa19ea6a6e85bfadffa12656291d448b3ffae8f952bc680e59bff5e43e\"" -> "W/\"97e3d586cf7d9b1f46eb450ac0adb2277cd978d61d015e0b91457a983f103f0b\""
        id         = "6602018:cdktf-provider-digitalocean"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79 has been changed
  ~ resource "github_repository" "repos_cdktfproviderkubernetes_repo_D69C3A79" {
      ~ etag                   = "W/\"b5bd234b2a8f35889f94d1dfe2743ddac96293aa29e0b6b017bb638d411c492c\"" -> "W/\"6dcc470d16185baf078153ac2d8a0c89af3962878cf0af1ada1e2e3061874e3b\""
        id                     = "cdktf-provider-kubernetes"
        name                   = "cdktf-provider-kubernetes"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_repositorysetup_managingteam_892197FD has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_repositorysetup_managingteam_892197FD" {
      ~ etag       = "W/\"d209be8e426278ae55a9baf6ac8a8d115a133141c9b0f4f10e35a1ceeedb5686\"" -> "W/\"0a605ee389bdb3cce26b2a32ca89a493fff7f8d41481cc5f8f3c3c8b926fc945\""
        id         = "6602018:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpostgresql_repositorysetup_managingteam_1A74D5A1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpostgresql_repositorysetup_managingteam_1A74D5A1" {
      ~ etag       = "W/\"468b0465e8589f5b890988a9a139cd5250947f21757b46d16dfddfe72b8dc144\"" -> "W/\"1f50e0a08857d954aef929d67f2c88f4aabad1c9eace26178fd4f1192bf9a217\""
        id         = "6602018:cdktf-provider-postgresql"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_repositorysetup_managingteam_CD112A1D has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_repositorysetup_managingteam_CD112A1D" {
      ~ etag       = "W/\"64e8536a137041292e7239f9db3649fabce91585b6694fddea8e8a83aa5cc076\"" -> "W/\"873824947d33d034ab491bc7e2d8aa3593a8feb665946a9611811bf1ef2c4e7b\""
        id         = "6602018:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideracme_repositorysetup_managingteam_B2C685CA has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideracme_repositorysetup_managingteam_B2C685CA" {
      ~ etag       = "W/\"54d4a619984b46e77f460e17d239463a9574d220f4d4f0aa0d5cdf6df809a9f4\"" -> "W/\"32acf4954fe69a1e9a3d8b64e30fa9c6919fb1da25972312d48e7517b4675075\""
        id         = "6602018:cdktf-provider-acme"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdigitaloceango_repositorysetup_managingteam_B082C767 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdigitaloceango_repositorysetup_managingteam_B082C767" {
      ~ etag       = "W/\"2e8c364ae4e552601d483750395c54d3b69c2d30b697613739fded5b445c642a\"" -> "W/\"67fb6bc28da2b3dd90db8cebeb941f99705085f86aae7794b52d4aa6d0390da3\""
        id         = "6602018:cdktf-provider-digitalocean-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurermgo_repositorysetup_managingteam_FE619067 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurermgo_repositorysetup_managingteam_FE619067" {
      ~ etag       = "W/\"83c30a4cf936c8facfb0e980e528cec3d690dcb313b8435fa6d3c3aa2f6ac825\"" -> "W/\"afa7f1e43995ffe6866efbbe9f3098fc17f15a0cbce80728b8377ee8b0a8c7bf\""
        id         = "6602018:cdktf-provider-azurerm-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidercloudflare_repo_69763868 has been changed
  ~ resource "github_repository" "repos_cdktfprovidercloudflare_repo_69763868" {
      ~ etag                   = "W/\"392f0acf16f30ff008186d3c9f7be895ca7ba12b7bbc4f40fafaa954d7ef903d\"" -> "W/\"7c669a4c994f7f0a53226a67ef06c2def13444ceb83106bec9ff322fbd1e3f7d\""
        id                     = "cdktf-provider-cloudflare"
        name                   = "cdktf-provider-cloudflare"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidervaultgo_repositorysetup_managingteam_3D03CE6E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidervaultgo_repositorysetup_managingteam_3D03CE6E" {
      ~ etag       = "W/\"7370c0f2f5529f403b032b1957663b9991ebdf300f96fdb41e53c55972a07af9\"" -> "W/\"36b0593a404d5d67ffae9f07f9da3db7e24b8cd00a27cdddb8c81eebac9bf40a\""
        id         = "6602018:cdktf-provider-vault-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernewrelic_repositorysetup_managingteam_EBE22D1D has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernewrelic_repositorysetup_managingteam_EBE22D1D" {
      ~ etag       = "W/\"64bb8124a77205b618ddb852056a49b6caeb0d5771605658b6ea74e0eb2df424\"" -> "W/\"33a5f843ac71f7506581096718d8a9db9bb7ee34dcecdf8f70bba9597b428809\""
        id         = "6602018:cdktf-provider-newrelic"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderproject_repo_014C3CE2 has been changed
  ~ resource "github_repository" "repos_cdktfproviderproject_repo_014C3CE2" {
      ~ etag                   = "W/\"039f847afbc9b86643f58ffecfdb5e64d6253d3f248b2f2dd15178ec49e1f65d\"" -> "W/\"5541836aebc09bed27e46c5867b3233c1cd240d4a4f18eb3aaaea0685c2c78ae\""
        id                     = "cdktf-provider-project"
        name                   = "cdktf-provider-project"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudflare_repositorysetup_managingteam_B6B6C03C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudflare_repositorysetup_managingteam_B6B6C03C" {
      ~ etag       = "W/\"ab3680b6977f8287f7a653622c33a79c1167e229a1bd25d6dc12f71762413d17\"" -> "W/\"93f0c07b1f57ae3f8f83bb125768e1cf84af473e3f7cf9061e3ea799ef0b06e4\""
        id         = "6602018:cdktf-provider-cloudflare"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderdatadoggo_repo_00B46F19 has been changed
  ~ resource "github_repository" "repos_cdktfproviderdatadoggo_repo_00B46F19" {
      ~ etag                   = "W/\"78f296bec2005820ae2bcaa665829e60ee81ff3791796fe27d7ddfe445d461c7\"" -> "W/\"767d186eff4898ef2fcf006fb8ae638ab5f5107c2b6a14126c795cb86385cb74\""
        id                     = "cdktf-provider-datadog-go"
        name                   = "cdktf-provider-datadog-go"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidersnowflake_repo_483928D8 has been changed
  ~ resource "github_repository" "repos_cdktfprovidersnowflake_repo_483928D8" {
      ~ etag                   = "W/\"b218c5007cbf332f2257fdaaa9be25508857e2c2447f463b799aea87347c1b15\"" -> "W/\"8cd56e5b463ac99fe0f8274552d432483369a394a4b9624582710872acd02a94\""
        id                     = "cdktf-provider-snowflake"
        name                   = "cdktf-provider-snowflake"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertime_repositorysetup_managingteam_5EEA5287 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertime_repositorysetup_managingteam_5EEA5287" {
      ~ etag       = "W/\"79363576ee2064c10995e107ecb01544edcc45565ca98c40ff7029f8626f1b72\"" -> "W/\"86684558603916fe58f05e2191c3517e579ecc4d72f6e3bc8daf850a81acf584\""
        id         = "6602018:cdktf-provider-time"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidersnowflake_repositorysetup_managingteam_3B7100C9 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidersnowflake_repositorysetup_managingteam_3B7100C9" {
      ~ etag       = "W/\"262ef0fcb3f15548a3447213ff52bd5dd9980c243a69d30ddba9347fabca6a8a\"" -> "W/\"42f5e606a9d5eb2bcf9085f94625ec9e661b1fcb20e89574a617d5a5d3989b6c\""
        id         = "6602018:cdktf-provider-snowflake"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideropentelekomcloudgo_repositorysetup_managingteam_CA4F75C1 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideropentelekomcloudgo_repositorysetup_managingteam_CA4F75C1" {
      ~ etag       = "W/\"b19dc4f2627e8841f1f05b2533adf2b87be19c1f8ce962316806791265f3b24b\"" -> "W/\"2fe2840be37c6405cfaca8652b2473fd4272dec3e31742d5236121f19d74f6c6\""
        id         = "6602018:cdktf-provider-opentelekomcloud-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideracme_repo_DD1AA41F has been changed
  ~ resource "github_repository" "repos_cdktfprovideracme_repo_DD1AA41F" {
      ~ etag                   = "W/\"afa84114572ae1d4b4ec0393589855a0345d3df3149431c254171f9c54dc490c\"" -> "W/\"65c16b3ee9efd7bddc04eee4f06897bfa5fc5e5a9bae4dbedbe5d2b4cfea8eab\""
        id                     = "cdktf-provider-acme"
        name                   = "cdktf-provider-acme"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergitlabgo_repositorysetup_managingteam_3DD27EA8 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergitlabgo_repositorysetup_managingteam_3DD27EA8" {
      ~ etag       = "W/\"5c3ec976a9a2f5d407922819f6e5a0cfb3aa8e3f04cdfcf98714d87f476b937e\"" -> "W/\"713322d83ab47efb05cc4bbd05516b1167ade5a4a28d1ce0c4bed7f2b677ce73\""
        id         = "6602018:cdktf-provider-gitlab-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderspotinstgo_repositorysetup_managingteam_8753A903 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderspotinstgo_repositorysetup_managingteam_8753A903" {
      ~ etag       = "W/\"c708a88acf4636ea7e00e26d6966f58512a488874df6cb492c897afbc9b28df1\"" -> "W/\"78a962b0cc02fdce7a0dc8b9df86f893a993ca7f096492659dc514f059c6391b\""
        id         = "6602018:cdktf-provider-spotinst-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideropentelekomcloud_repositorysetup_managingteam_E8C53767 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideropentelekomcloud_repositorysetup_managingteam_E8C53767" {
      ~ etag       = "W/\"8ff3f3fa284da0640a5951c6abad21305776b77460a2e0ba62abb70eece1f462\"" -> "W/\"849161e16abc2f162c27d7a556c13c2f30d6b8021cc1ccd662e8107464249c1d\""
        id         = "6602018:cdktf-provider-opentelekomcloud"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_repositorysetup_managingteam_09F895B2 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_repositorysetup_managingteam_09F895B2" {
      ~ etag       = "W/\"9b94a47b1623a70511e274364cac09ca97d0b46a2ec6054ea1327d879e2a35ac\"" -> "W/\"9309f8162de199742a10b167d17802c28e4338cbb1376eac47d356d71e441aaa\""
        id         = "6602018:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderazurerm_repo_19E06DC3 has been changed
  ~ resource "github_repository" "repos_cdktfproviderazurerm_repo_19E06DC3" {
      ~ etag                   = "W/\"283b20ac655c35e9a119e2b5a13d61c13c6d1ac6e4d674e41675c6a25e845bb2\"" -> "W/\"817515b694e97dfbf2be58a358ff65ea3288eb69312e1b522ae2eb8f4112cf7e\""
        id                     = "cdktf-provider-azurerm"
        name                   = "cdktf-provider-azurerm"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideroktago_repositorysetup_managingteam_2FF4D160 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideroktago_repositorysetup_managingteam_2FF4D160" {
      ~ etag       = "W/\"9dc75f5f2e3c0fde1d04d1075058b8e5803d6f14d0a3022ce48f80e7bd98857b\"" -> "W/\"682cb1a8ebb14f471b9300660b47e144783438c2289bb593ea1c5a64edd99399\""
        id         = "6602018:cdktf-provider-okta-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdnsimple_repositorysetup_managingteam_30FA9B9E has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdnsimple_repositorysetup_managingteam_30FA9B9E" {
      ~ etag       = "W/\"7d32ee8ffd749a357fcf146362ff66404ef368779af56833391fac130a78cde6\"" -> "W/\"332773d31239c18adfdb5245b2a4bf0a1867735431c8126f252909db5268ba0d\""
        id         = "6602018:cdktf-provider-dnsimple"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_repositorysetup_managingteam_345DF047 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_repositorysetup_managingteam_345DF047" {
      ~ etag       = "W/\"d67e72703e8d4e621118b7f0dd16b5d068df2d1a1398d7efae5f535994fa0c54\"" -> "W/\"64734bb71503f9e9a2d3bc1b489eb598c8875793e98a6da4190a2466f8d98913\""
        id         = "6602018:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergitlab_repositorysetup_managingteam_31742640 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergitlab_repositorysetup_managingteam_31742640" {
      ~ etag       = "W/\"6723fd0585364aa01059063a62971225333846f52f8c24b11f9035a5682b06fc\"" -> "W/\"b868359ff0e5a5999f3fdf8c3515ef8eb674dbcbc4f1d27b41d724da3bcd564a\""
        id         = "6602018:cdktf-provider-gitlab"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideraws_repo_55F46B23 has been changed
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ etag                   = "W/\"4ee43437e34ab320406b3af1b2fa9d6b7dec7f2bb50846b7f69ff16df67a4850\"" -> "W/\"49dcb1118d7c94a1521cf1a045b55b1cd3b11328e5777bdee130e80832661cff\""
        id                     = "cdktf-provider-aws"
        name                   = "cdktf-provider-aws"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertfego_repositorysetup_managingteam_19BE5A50 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertfego_repositorysetup_managingteam_19BE5A50" {
      ~ etag       = "W/\"b503213911d0fc26fd441e5abe190114fde3dce730badefcc0a2e952e2787108\"" -> "W/\"3c0420620f065cba093b10676af1cc1f4e9b1986bc0a9aea23a57dea0cc7d14d\""
        id         = "6602018:cdktf-provider-tfe-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_repositorysetup_managingteam_DFA62268 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_repositorysetup_managingteam_DFA62268" {
      ~ etag       = "W/\"348892af40808d88f013bd75e16a42b0111294c83bc63d2009a55f350e1e3e6a\"" -> "W/\"59c538bfbcfa3a82ca9bb17d73e725b50ca7cb1edf952e96ee49d5d3fc352c7b\""
        id         = "6602018:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidergithub_repo_66B8E54A has been changed
  ~ resource "github_repository" "repos_cdktfprovidergithub_repo_66B8E54A" {
      ~ etag                   = "W/\"0957bd9d04c79189e2e9d4e4627246c9cf7129b3cec99020af9c267a047c1d96\"" -> "W/\"e947842639ff8e8ad0f9449e37ea785853cbf12ed22e63b2eeb9c7c7531d0ccb\""
        id                     = "cdktf-provider-github"
        name                   = "cdktf-provider-github"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernullgo_repositorysetup_managingteam_0D5AEAB7 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernullgo_repositorysetup_managingteam_0D5AEAB7" {
      ~ etag       = "W/\"e14868478e3490e9445e6223d3c0f4424589cb713e9a2297ff46c4cf476e316a\"" -> "W/\"364476c65f51ef1ccfc77f13bc14dcdfeb3aa82b390554a88d8d68d44be537e7\""
        id         = "6602018:cdktf-provider-null-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderionoscloud_repositorysetup_managingteam_7B7276FB has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderionoscloud_repositorysetup_managingteam_7B7276FB" {
      ~ etag       = "W/\"5ef2794f11f24b6f940b543129d64ad65af2daed45059001ffe3f67576b9c872\"" -> "W/\"89cdcda6b34ebbb8e92337ddd0c0c23fc18bb7527e7e94455eb37502e1c62880\""
        id         = "6602018:cdktf-provider-ionoscloud"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergooglebeta_repositorysetup_managingteam_B8CAECA5 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergooglebeta_repositorysetup_managingteam_B8CAECA5" {
      ~ etag       = "W/\"c74d1848a787b77006d8845b4791c9d9593c6f21bba55624f559b747cf76cef6\"" -> "W/\"90cd118f7c1959c304c41ad23d6977d4537930e502e3d9678a424e4cc7e87952\""
        id         = "6602018:cdktf-provider-googlebeta"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderpostgresql_repo_9CD37AD7 has been changed
  ~ resource "github_repository" "repos_cdktfproviderpostgresql_repo_9CD37AD7" {
      ~ etag                   = "W/\"889e2b710fe9c5657e9f9d3268ebe2a68933c98275ab57cecf06d1a215d75141\"" -> "W/\"c1a3ff63de578653c20056c25531e69565e8ff0601691e276c63b7bde4ae065e\""
        id                     = "cdktf-provider-postgresql"
        name                   = "cdktf-provider-postgresql"
        # (26 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidertemplate_repo_08DFB684 has been changed
  ~ resource "github_repository" "repos_cdktfprovidertemplate_repo_08DFB684" {
      ~ etag                   = "W/\"d13b03531a54b8852869b034c86708bc371a3a6281adbf015238b6d052b0560c\"" -> "W/\"751416d8da59b5f8d1af3019cd67269e831e15a36295f8fff2fd83a2a5ff98c6\""
        id                     = "cdktf-provider-template"
        name                   = "cdktf-provider-template"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidercloudflarego_repositorysetup_managingteam_D3449EB2 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidercloudflarego_repositorysetup_managingteam_D3449EB2" {
      ~ etag       = "W/\"d0e90f343afd19e61e637adcac86ad51faeec1775f6c92d49e200255cd990a5f\"" -> "W/\"a19541e33eb01d5b37e7d336de486647c0eaabc2e848c573146828472b51c078\""
        id         = "6602018:cdktf-provider-cloudflare-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderpagerduty_repositorysetup_managingteam_BBF13F0C has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderpagerduty_repositorysetup_managingteam_BBF13F0C" {
      ~ etag       = "W/\"156e753e63586820b08db6a0ed373d98b4b1c59eab6f41449f2840a6aa89c1f5\"" -> "W/\"faeaf66da90119baa2d2314991db6e5d2d3ac66874c2104abc19f1b284074db1\""
        id         = "6602018:cdktf-provider-pagerduty"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideropentelekomcloud_repo_8ABA825B has been changed
  ~ resource "github_repository" "repos_cdktfprovideropentelekomcloud_repo_8ABA825B" {
      ~ etag                   = "W/\"b816c1d2e14569cf702459e7f11e9d945b6194e32267957854c0c5221a12c195\"" -> "W/\"3f72e04ce85d5b4869851277ed1ca43d7d16ec1f695571c30d2b65018d8aafa0\""
        id                     = "cdktf-provider-opentelekomcloud"
        name                   = "cdktf-provider-opentelekomcloud"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdocker_repositorysetup_managingteam_39B293A8 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_repositorysetup_managingteam_39B293A8" {
      ~ etag       = "W/\"90893276d71dcb7ec3230c00a684b96175df35d44b0d8cf24e9338b272b4d42c\"" -> "W/\"80b8e12f64eb00e90730be6ea2180c090c292412aca5294b2a383b5e6b0683fa\""
        id         = "6602018:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergooglebetago_repositorysetup_managingteam_D83EF40E has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergooglebetago_repositorysetup_managingteam_D83EF40E" {
      ~ etag       = "W/\"d067c6421ebe1553a71e1e9997cde6b9d1d605bc600ac2007de11fc1d8fbbb75\"" -> "W/\"4767fe3488b263ef24243e6e0a33429c41496dfbe669a83d2565c7d8747d3d70\""
        id         = "6602018:cdktf-provider-googlebeta-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdockergo_repositorysetup_managingteam_58AEF965 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdockergo_repositorysetup_managingteam_58AEF965" {
      ~ etag       = "W/\"280e3a3c693d2db57ba0c8cd9a92269e899380a2237f0cdf7d0961a6c9002e4f\"" -> "W/\"eda73fbeb5df83ac6abc433a9ee2958272a0f55c636857e0a34c2b758d34e4fe\""
        id         = "6602018:cdktf-provider-docker-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderawsgo_repositorysetup_managingteam_8F56FD3E has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderawsgo_repositorysetup_managingteam_8F56FD3E" {
      ~ etag       = "W/\"c14d4dbf315c69af6aa82552099ba93b2e2b4429aea4109e06b9fa205db94515\"" -> "W/\"6ad23ee78cab30a6e4f5ace6bcc06c4b946260dd0df294ee3accbce89f737ae7\""
        id         = "6602018:cdktf-provider-aws-go"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfproviderhelm_repo_E5C9B6C8 has been changed
  ~ resource "github_repository" "repos_cdktfproviderhelm_repo_E5C9B6C8" {
      ~ etag                   = "W/\"e9332994e0a260f98ccf5f9a397bb64dc80520fdecf1401ca0e4335358e6e238\"" -> "W/\"d577c346710f2b00d2833d2e32837e72bc997a846efa83df6828d79a36217c05\""
        id                     = "cdktf-provider-helm"
        name                   = "cdktf-provider-helm"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertls_repositorysetup_managingteam_77FE4EF4 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertls_repositorysetup_managingteam_77FE4EF4" {
      ~ etag       = "W/\"998567973830ca66c45f18a463a9f8ddd98ac4ea9f495848a9c3d49acbe47a05\"" -> "W/\"b8aed120122fee8190e543647a2c7e8ff73ae155a4304e7134345a5199ceddf9\""
        id         = "6602018:cdktf-provider-tls"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernullgo_repo_1E975951 has been changed
  ~ resource "github_repository" "repos_cdktfprovidernullgo_repo_1E975951" {
      ~ etag                   = "W/\"5c6bcb3cb809bdd37da4d4f7a7fbcf9ae9f0b7c10f0d35b16a827b2982de20fd\"" -> "W/\"ed06a537301ae219ef5ec971b3b645c884e085ac081c103db7c9d3b377829964\""
        id                     = "cdktf-provider-null-go"
        name                   = "cdktf-provider-null-go"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidertfe_repositorysetup_managingteam_33D41BAB has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidertfe_repositorysetup_managingteam_33D41BAB" {
      ~ etag       = "W/\"9ca954cd479ff5d6a4ea40bf1b753c1a4d30075b821262c148fd566c51ca4e86\"" -> "W/\"3beb2a668e1a9e08ae993b78557e773fdcf7f89beae26324867d23d7fa54ab2e\""
        id         = "6602018:cdktf-provider-tfe"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_repositorysetup_managingteam_4B78DB32 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_repositorysetup_managingteam_4B78DB32" {
      ~ etag       = "W/\"22f2c22777eda88f6c377226652e0e06fcb88cfcfdc48f4c24f1b21fe114605b\"" -> "W/\"79a84dd715d688ce449522bf167e143eb3eda73b774167980fd5caaaf08cd52c\""
        id         = "6602018:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderokta_repositorysetup_managingteam_0EC4F3DA has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderokta_repositorysetup_managingteam_0EC4F3DA" {
      ~ etag       = "W/\"cb6ea0ff2c347cb741bc5d71165f07bdaa585a788dc3117375d1c4c5641b88e0\"" -> "W/\"1971ab5c534d9d024f472837e9bacbb9106003aac2dd4b658e651bc462ce56c6\""
        id         = "6602018:cdktf-provider-okta"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetesgo_repositorysetup_managingteam_F07D5F4D has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetesgo_repositorysetup_managingteam_F07D5F4D" {
      ~ etag       = "W/\"c74771f5f65f1f2c8681871661dd841289731e46e0a87ae1022c7570d3f8bacd\"" -> "W/\"99b9a5c2c104f48f4448f6ff3d928961c78a6193364a13a2d5c026d0f78134a3\""
        id         = "6602018:cdktf-provider-kubernetes-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderhelm_repositorysetup_managingteam_A4243DAE has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderhelm_repositorysetup_managingteam_A4243DAE" {
      ~ etag       = "W/\"7a59eb184057059ade308e42090d36d2ed1fc6d6c561e05fc7afbdfa1d359d8a\"" -> "W/\"f762a5b9f7cb5ca2f8704fac34ec5d65bde8ae2919992eb2ad361eea245e18c3\""
        id         = "6602018:cdktf-provider-helm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithubgo_repositorysetup_managingteam_2896D63F has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithubgo_repositorysetup_managingteam_2896D63F" {
      ~ etag       = "W/\"5ae625da63fe7abce6754f2006e9efef14b06a671cc66e051bdfb05ae2de4057\"" -> "W/\"3e8e84037d753a12918f507d9c744e107c0574a71377599c10790b788b762060\""
        id         = "6602018:cdktf-provider-github-go"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderarchive_repositorysetup_managingteam_773585EF has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderarchive_repositorysetup_managingteam_773585EF" {
      ~ etag       = "W/\"7d9affa9b133126b86e4b81beed3183e7d42fb2fa47b13b3952ce2e1079c0e7a\"" -> "W/\"cd353cb2df31e0e89b37d9455ddf04b50a74680c1f96c8e3ce46992299b29278\""
        id         = "6602018:cdktf-provider-archive"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovidernewrelic_repo_D84B1F73 has been changed
  ~ resource "github_repository" "repos_cdktfprovidernewrelic_repo_D84B1F73" {
      ~ etag                   = "W/\"ac1a66239a7a3e8b2d92c9cc0c997c19ebb4797fd3d53eacfbea12c5a11a5cf1\"" -> "W/\"fb1aef8c329a9561f450dbaebf5f8c132471ed93b74e7cc033407b1a4de78be7\""
        id                     = "cdktf-provider-newrelic"
        name                   = "cdktf-provider-newrelic"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatabricks_repositorysetup_managingteam_8D34FFE1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatabricks_repositorysetup_managingteam_8D34FFE1" {
      ~ etag       = "W/\"aa639c0b37db0ccb1ce1a40ee228a53a62dd58a23ab75ca8dde2d0abcfce4742\"" -> "W/\"9d58e839fdab063841f229185cf0e118067e7b144e7d0dfab2a6ae71cec306eb\""
        id         = "6602018:cdktf-provider-databricks"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergooglego_repositorysetup_managingteam_20D524CA has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergooglego_repositorysetup_managingteam_20D524CA" {
      ~ etag       = "W/\"6956498972dea928812a9848dcee022c40a37aeb55e5b46cddeb5e57ffe2ad6b\"" -> "W/\"184d4cf835c64dd1559ad515bd5e48ea0be0f605bfdeac371582d83aee73f4ca\""
        id         = "6602018:cdktf-provider-google-go"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repos_cdktfprovideracme_repo_secretalertprsslackwebhookurl_08B433AB will be created
  + resource "github_actions_secret" "repos_cdktfprovideracme_repo_secretalertprsslackwebhookurl_08B433AB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderarchive_repo_secretalertprsslackwebhookurl_FB7A0BD9 will be created
  + resource "github_actions_secret" "repos_cdktfproviderarchive_repo_secretalertprsslackwebhookurl_FB7A0BD9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideraws_repo_secretalertprsslackwebhookurl_E4CEEBA4 will be created
  + resource "github_actions_secret" "repos_cdktfprovideraws_repo_secretalertprsslackwebhookurl_E4CEEBA4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderazuread_repo_secretalertprsslackwebhookurl_E2ED4921 will be created
  + resource "github_actions_secret" "repos_cdktfproviderazuread_repo_secretalertprsslackwebhookurl_E2ED4921" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderazurerm_repo_secretalertprsslackwebhookurl_3FB11608 will be created
  + resource "github_actions_secret" "repos_cdktfproviderazurerm_repo_secretalertprsslackwebhookurl_3FB11608" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidercloudflare_repo_secretalertprsslackwebhookurl_4F8BA93E will be created
  + resource "github_actions_secret" "repos_cdktfprovidercloudflare_repo_secretalertprsslackwebhookurl_4F8BA93E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidercloudinit_repo_secretalertprsslackwebhookurl_BDE40EF5 will be created
  + resource "github_actions_secret" "repos_cdktfprovidercloudinit_repo_secretalertprsslackwebhookurl_BDE40EF5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderdatabricks_repo_secretalertprsslackwebhookurl_EDB1B8E8 will be created
  + resource "github_actions_secret" "repos_cdktfproviderdatabricks_repo_secretalertprsslackwebhookurl_EDB1B8E8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderdatadog_repo_secretalertprsslackwebhookurl_3763B883 will be created
  + resource "github_actions_secret" "repos_cdktfproviderdatadog_repo_secretalertprsslackwebhookurl_3763B883" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderdigitalocean_repo_secretalertprsslackwebhookurl_54DC8198 will be created
  + resource "github_actions_secret" "repos_cdktfproviderdigitalocean_repo_secretalertprsslackwebhookurl_54DC8198" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderdnsimple_repo_secretalertprsslackwebhookurl_0A8FB5B5 will be created
  + resource "github_actions_secret" "repos_cdktfproviderdnsimple_repo_secretalertprsslackwebhookurl_0A8FB5B5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-dnsimple"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderdocker_repo_secretalertprsslackwebhookurl_E18359B4 will be created
  + resource "github_actions_secret" "repos_cdktfproviderdocker_repo_secretalertprsslackwebhookurl_E18359B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderexternal_repo_secretalertprsslackwebhookurl_0F1B73E6 will be created
  + resource "github_actions_secret" "repos_cdktfproviderexternal_repo_secretalertprsslackwebhookurl_0F1B73E6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidergithub_repo_secretalertprsslackwebhookurl_600C07C4 will be created
  + resource "github_actions_secret" "repos_cdktfprovidergithub_repo_secretalertprsslackwebhookurl_600C07C4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidergitlab_repo_secretalertprsslackwebhookurl_67FA9180 will be created
  + resource "github_actions_secret" "repos_cdktfprovidergitlab_repo_secretalertprsslackwebhookurl_67FA9180" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-gitlab"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidergoogle_repo_secretalertprsslackwebhookurl_F190197B will be created
  + resource "github_actions_secret" "repos_cdktfprovidergoogle_repo_secretalertprsslackwebhookurl_F190197B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidergooglebeta_repo_secretalertprsslackwebhookurl_0DC6AB15 will be created
  + resource "github_actions_secret" "repos_cdktfprovidergooglebeta_repo_secretalertprsslackwebhookurl_0DC6AB15" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-googlebeta"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhashicups_repo_secretalertprsslackwebhookurl_94CD6775 will be created
  + resource "github_actions_secret" "repos_cdktfproviderhashicups_repo_secretalertprsslackwebhookurl_94CD6775" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-hashicups"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderhelm_repo_secretalertprsslackwebhookurl_6CCE578F will be created
  + resource "github_actions_secret" "repos_cdktfproviderhelm_repo_secretalertprsslackwebhookurl_6CCE578F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-helm"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderionoscloud_repo_secretalertprsslackwebhookurl_045880DD will be created
  + resource "github_actions_secret" "repos_cdktfproviderionoscloud_repo_secretalertprsslackwebhookurl_045880DD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-ionoscloud"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderkubernetes_repo_secretalertprsslackwebhookurl_322119B3 will be created
  + resource "github_actions_secret" "repos_cdktfproviderkubernetes_repo_secretalertprsslackwebhookurl_322119B3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderlocal_repo_secretalertprsslackwebhookurl_78BDAFD7 will be created
  + resource "github_actions_secret" "repos_cdktfproviderlocal_repo_secretalertprsslackwebhookurl_78BDAFD7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-local"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidernewrelic_repo_secretalertprsslackwebhookurl_216C76B4 will be created
  + resource "github_actions_secret" "repos_cdktfprovidernewrelic_repo_secretalertprsslackwebhookurl_216C76B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-newrelic"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidernull_repo_secretalertprsslackwebhookurl_DEBA8284 will be created
  + resource "github_actions_secret" "repos_cdktfprovidernull_repo_secretalertprsslackwebhookurl_DEBA8284" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderokta_repo_secretalertprsslackwebhookurl_0EC3E710 will be created
  + resource "github_actions_secret" "repos_cdktfproviderokta_repo_secretalertprsslackwebhookurl_0EC3E710" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-okta"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovideropentelekomcloud_repo_secretalertprsslackwebhookurl_6A5C99DA will be created
  + resource "github_actions_secret" "repos_cdktfprovideropentelekomcloud_repo_secretalertprsslackwebhookurl_6A5C99DA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-opentelekomcloud"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderpagerduty_repo_secretalertprsslackwebhookurl_9A0ECD7C will be created
  + resource "github_actions_secret" "repos_cdktfproviderpagerduty_repo_secretalertprsslackwebhookurl_9A0ECD7C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-pagerduty"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderpostgresql_repo_secretalertprsslackwebhookurl_4074699E will be created
  + resource "github_actions_secret" "repos_cdktfproviderpostgresql_repo_secretalertprsslackwebhookurl_4074699E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-postgresql"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderrandom_repo_secretalertprsslackwebhookurl_00A7217A will be created
  + resource "github_actions_secret" "repos_cdktfproviderrandom_repo_secretalertprsslackwebhookurl_00A7217A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidersnowflake_repo_secretalertprsslackwebhookurl_D4E74AAD will be created
  + resource "github_actions_secret" "repos_cdktfprovidersnowflake_repo_secretalertprsslackwebhookurl_D4E74AAD" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-snowflake"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderspotinst_repo_secretalertprsslackwebhookurl_7E0BAAC1 will be created
  + resource "github_actions_secret" "repos_cdktfproviderspotinst_repo_secretalertprsslackwebhookurl_7E0BAAC1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-spotinst"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidertemplate_repo_secretalertprsslackwebhookurl_CAF70774 will be created
  + resource "github_actions_secret" "repos_cdktfprovidertemplate_repo_secretalertprsslackwebhookurl_CAF70774" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-template"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidertfe_repo_secretalertprsslackwebhookurl_2D562DD8 will be created
  + resource "github_actions_secret" "repos_cdktfprovidertfe_repo_secretalertprsslackwebhookurl_2D562DD8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-tfe"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidertime_repo_secretalertprsslackwebhookurl_ADF4B038 will be created
  + resource "github_actions_secret" "repos_cdktfprovidertime_repo_secretalertprsslackwebhookurl_ADF4B038" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-time"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidertls_repo_secretalertprsslackwebhookurl_06D4E0B7 will be created
  + resource "github_actions_secret" "repos_cdktfprovidertls_repo_secretalertprsslackwebhookurl_06D4E0B7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-tls"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfproviderupcloud_repo_secretalertprsslackwebhookurl_544A4602 will be created
  + resource "github_actions_secret" "repos_cdktfproviderupcloud_repo_secretalertprsslackwebhookurl_544A4602" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-upcloud"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_cdktfprovidervault_repo_secretalertprsslackwebhookurl_5AA080FF will be created
  + resource "github_actions_secret" "repos_cdktfprovidervault_repo_secretalertprsslackwebhookurl_5AA080FF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-vault"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

::debug::Terraform exited with code 0.
::debug::stderr: 
::debug::exitcode: 0


::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

*Pusher: @ansgarm, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*